# BasePlate3D

Representation of Base Plate 3D in IDEA StatiCa Detail

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.base_plate3_d import BasePlate3D

# TODO update the JSON string below
json = "{}"
# create an instance of BasePlate3D from a JSON string
base_plate3_d_instance = BasePlate3D.from_json(json)
# print the JSON string representation of the object
print(BasePlate3D.to_json())

# convert the object into a dict
base_plate3_d_dict = base_plate3_d_instance.to_dict()
# create an instance of BasePlate3D from a dict
base_plate3_d_from_dict = BasePlate3D.from_dict(base_plate3_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)